//------------------------------------------------------------------------------
// This is Open source software. You can place this code on your site, but don't
// forget a link to my YouTube-channel: https://www.youtube.com/channel/UChButpZaL5kUUl_zTyIDFkQ
// Это программное обеспечение распространяется свободно. Вы можете размещать
// его на вашем сайте, но не забудьте указать ссылку на мой YouTube-канал 
// "Электроника в объектике" https://www.youtube.com/channel/UChButpZaL5kUUl_zTyIDFkQ
// Автор: Надыршин Руслан / Nadyrshin Ruslan
//------------------------------------------------------------------------------
#include "main.h"

//Timer Functions
static u32 delay = 0;

//==============================================================================
// Таймер срабатывает каждую 1мкс
//==============================================================================
void SysTick_Handler(void)
{
	static u16 led = 0;

	if(delay){delay--;}

	if(++led >= 50000){
		led=0;
		PIN_REVERSE(USER_LED_green);
	}
}

//==============================================================================
// Процедура программной задержки 1 мкс
//==============================================================================
void delay_us(u32 ms)
{
	delay = ms;
	while(delay){}
}
//==============================================================================

//==============================================================================
// Процедура программной задержки 1 мс
//==============================================================================
void delay_ms(u32 ms)
{
	delay = ms * 100;
	while(delay){}
}
//==============================================================================
