//------------------------------------------------------------------------------
// This is Open source software. You can place this code on your site, but don't
// forget a link to my YouTube-channel: https://www.youtube.com/channel/UChButpZaL5kUUl_zTyIDFkQ
// Это программное обеспечение распространяется свободно. Вы можете размещать
// его на вашем сайте, но не забудьте указать ссылку на мой YouTube-канал 
// "Электроника в объектике" https://www.youtube.com/channel/UChButpZaL5kUUl_zTyIDFkQ
// Автор: Надыршин Руслан / Nadyrshin Ruslan
//------------------------------------------------------------------------------
#include "delay.h"

//Timer Functions
static unsigned int delay = 0;

//==============================================================================
// Таймер срабатывает каждую 1мкс
//==============================================================================
void SysTick_Handler(void)
{
	if(delay){delay--;}
}

//==============================================================================
// Процедура программной задержки 1 мкс
//==============================================================================
void delay_us(unsigned int ms)
{
	delay = ms;
	while(delay){}
}
//==============================================================================

//==============================================================================
// Процедура программной задержки 1 мс
//==============================================================================
void delay_ms(unsigned int ms)
{
	delay = ms * 1000;
	while(delay){}
}
//==============================================================================
